In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [17]:
df_2022 = pd.read_csv('FOCW_CBI_21_22_shift.csv')

In [18]:
df_2023 = pd.read_csv("SHIFTS (2).csv")

In [19]:
df_2022.head(1)

,objectid,YEAR,VISIT_DATE,DAY_OF_WEEK,AGENCY_DESC,AGENCY_ID,SITE_NAME,SITE_ID,LAT,LONG,...,PAY_VOL,START_SHIFT,TRAILERS,INSPECTIONS,END_SHIFT,SHIFT_LENGTH,SURVEY,COMMENTS,TOTALINSP,NUMINVASIVE
0,8977,2021,5/28/2021,Fri,FOCW (Friends of the Cobbossee Watershed),50,Launch Drive,376,44.23825,-69.96728,...,Paid,12:00,10.0,Yes,18:00,360,During shift/at ramp,NaN,33,NaN

In [20]:
df_2023.head(1)

,ObjectID,DATE1,DAY_OF_WEEK,AGENCY_DESC,SITE_NAME,TOWN,WATERBODY,FNAME,LNAME,INSPECTOR_ID,...,SHIFT_LENGTH,TRAILERS,TOTAL_NM,TOTAL_M,TOTALINSP,COMMENTS,NUMINVASIVE,GlobalID,x,y
0,71,5/12/2023,Fri,FOCW (Friends of the Cobbossee Watershed),Launch Drive Cobbosseecontee,Monmouth,Cobbosseecontee Lake,Emily,Lucas,5305,...,190,2.0,0.0,5,5.0,\r\n,0.0,2efd8f58-5a9e-4b75-8e56-4cb720b404ab,-69.96728,44.23825

In [21]:
df_2022.rename(columns={'objectid': 'ObjectID', 'VISIT_DATE': 'DATE1', 'START_SHIFT': 'SHIFT_START', 'END_SHIFT': 'SHIFT_END'}, inplace=True)

In [22]:
df_2023.drop(columns=['ObjectID', 'AGENCY_DESC', 'FNAME', 'LNAME', 'NUMINVASIVE', 'TOTAL_NM', 'TOTAL_M', 'COMMENTS', 'GlobalID', 'x', 'y'], inplace=True)

In [23]:
df_2022.drop(columns=['ObjectID', 'YEAR', 'AGENCY_DESC', 'AGENCY_ID', 'SITE_ID', 'LAT', 'LONG', 'SURVEY', 'COMMENTS', 'NUMINVASIVE'], inplace=True)

In [24]:
df_2023.head(1)

,DATE1,DAY_OF_WEEK,SITE_NAME,TOWN,WATERBODY,INSPECTOR_ID,PAY_VOL,SHIFT_START,SHIFT_END,SHIFT_LENGTH,TRAILERS,TOTALINSP
0,5/12/2023,Fri,Launch Drive Cobbosseecontee,Monmouth,Cobbosseecontee Lake,5305,Paid,08:50,12:00,190,2.0,5.0

In [25]:
df_2022.head(1)

,DATE1,DAY_OF_WEEK,SITE_NAME,TOWN,WATER_REGION_ID,WATERBODY,MIDAS,NAME_FL,FNAME,LNAME,INSPECTOR_ID,PAY_VOL,SHIFT_START,TRAILERS,INSPECTIONS,SHIFT_END,SHIFT_LENGTH,TOTALINSP
0,5/28/2021,Fri,Launch Drive,Monmouth,698,Cobbosseecontee Lake,5236,Kathryn Ross,Kathryn,Ross,4771,Paid,12:00,10.0,Yes,18:00,360,33

In [26]:
df_2022.drop(columns=['WATER_REGION_ID', 'MIDAS', 'NAME_FL', 'FNAME', 'LNAME', 'INSPECTIONS'], inplace=True)

In [27]:
df_2022.head(1)

,DATE1,DAY_OF_WEEK,SITE_NAME,TOWN,WATERBODY,INSPECTOR_ID,PAY_VOL,SHIFT_START,TRAILERS,SHIFT_END,SHIFT_LENGTH,TOTALINSP
0,5/28/2021,Fri,Launch Drive,Monmouth,Cobbosseecontee Lake,4771,Paid,12:00,10.0,18:00,360,33

In [58]:
weather = pd.read_csv('weather.csv')

In [29]:
weather.head(1)

,STATION,NAME,LATITUDE,LONGITUDE,ELEVATION,DATE,DAPR,MDPR,PRCP,SNOW,SNWD,TMAX,TMIN,TOBS,WT01,WT03,WT04,WT05,WT06,WT11
0,USC00179721,"WINTHROP, ME US",44.30656,-69.97016,63.4,2021-01-01,NaN,NaN,0.0,0.0,0.0,42.0,20.0,25.0,NaN,NaN,NaN,NaN,NaN,NaN

In [59]:
weather.drop(columns=['STATION', 'LATITUDE', 'LONGITUDE', 'ELEVATION', 'DAPR', 'MDPR', 'SNWD', 'WT01', 'WT03', 'WT04', 'WT05', 'WT06', 'WT11'], inplace=True)

In [32]:
weather.head(1)

              NAME        DATE  PRCP  SNOW  TMAX  TMIN  TOBS
0  WINTHROP, ME US  2021-01-01   0.0   0.0  42.0  20.0  25.0

In [34]:
weather.NAME.value_counts()

READFIELD 2.0 NNE, ME US    1050
WINTHROP, ME US             1037
WAYNE 3.2 SSE, ME US         988
WINTHROP 1.8 WSW, ME US      301
WINTHROP 5.8 NE, ME US       107
Name: NAME, dtype: int64

In [35]:
weather.describe()

              PRCP         SNOW        TMAX        TMIN        TOBS
count  3439.000000  2985.000000  941.000000  946.000000  979.000000
mean      0.131329     0.159598   61.587673   41.734672   47.755873
std       0.345630     0.871466   19.305771   18.332104   18.561969
min       0.000000     0.000000    8.000000  -17.000000   -9.000000
25%       0.000000     0.000000   46.000000   28.000000   33.000000
50%       0.000000     0.000000   65.000000   44.500000   50.000000
75%       0.080000     0.000000   78.000000   57.000000   63.000000
max       5.150000    13.000000   95.000000   74.000000   85.000000

In [60]:
weather = weather[weather['NAME']== 'WINTHROP, ME US']

In [61]:
weather.shape

(1037, 7)

In [62]:
weather.drop(columns=['SNOW', 'NAME'], inplace=True)

In [63]:
weather.rename(columns={'DATE': 'DATE1'}, inplace=True)

In [64]:
weather.head(1)

        DATE1  PRCP  TMAX  TMIN  TOBS
0  2021-01-01   0.0  42.0  20.0  25.0

In [65]:
weather['DATE1'] = pd.to_datetime(weather['DATE1'])

In [66]:
weather.head(1)

       DATE1  PRCP  TMAX  TMIN  TOBS
0 2021-01-01   0.0  42.0  20.0  25.0

In [67]:
weather['DATE1'] = weather['DATE1'].dt.strftime('%m/%d/%Y')

In [68]:
weather.head(1)

        DATE1  PRCP  TMAX  TMIN  TOBS
0  01/01/2021   0.0  42.0  20.0  25.0

In [40]:
shift_df = pd.concat([df_2022, df_2023], axis=0, ignore_index=False)

In [71]:
shift_df.shape

(2669, 12)

In [76]:
shift_df.dtypes

DATE1           datetime64[ns]
DAY_OF_WEEK             object
SITE_NAME               object
TOWN                    object
WATERBODY               object
INSPECTOR_ID             int64
PAY_VOL                 object
SHIFT_START             object
TRAILERS               float64
SHIFT_END               object
SHIFT_LENGTH             int64
TOTALINSP              float64
dtype: object

In [75]:
shift_df['DATE1'] = pd.to_datetime(shift_df['DATE1'])

In [44]:
shift_df.isna().sum()

DATE1             0
DAY_OF_WEEK       0
SITE_NAME         0
TOWN              0
WATERBODY         0
INSPECTOR_ID      0
PAY_VOL           0
SHIFT_START       0
TRAILERS        522
SHIFT_END         0
SHIFT_LENGTH      0
TOTALINSP         2
dtype: int64

In [78]:
weather.dtypes

DATE1     object
PRCP     float64
TMAX     float64
TMIN     float64
TOBS     float64
dtype: object

In [79]:
weather['DATE1']=pd.to_datetime(weather['DATE1'])

In [80]:
df = pd.merge(left=shift_df, right=weather, how='left', on='DATE1')

In [81]:
df.isna().sum()

DATE1             0
DAY_OF_WEEK       0
SITE_NAME         0
TOWN              0
WATERBODY         0
INSPECTOR_ID      0
PAY_VOL           0
SHIFT_START       0
TRAILERS        522
SHIFT_END         0
SHIFT_LENGTH      0
TOTALINSP         2
PRCP             27
TMAX             91
TMIN             95
TOBS             55
dtype: int64

In [82]:
df.head()

,DATE1,DAY_OF_WEEK,SITE_NAME,TOWN,WATERBODY,INSPECTOR_ID,PAY_VOL,SHIFT_START,TRAILERS,SHIFT_END,SHIFT_LENGTH,TOTALINSP,PRCP,TMAX,TMIN,TOBS
0,2021-05-28,Fri,Launch Drive,Monmouth,Cobbosseecontee Lake,4771,Paid,12:00,10.0,18:00,360,33.0,0.00,72.0,45.0,49.0
1,2021-05-28,Fri,Whippoorwill Road,Litchfield,Woodbury Pond,4174,Paid,12:00,1.0,18:00,360,13.0,0.00,72.0,45.0,49.0
2,2021-05-28,Fri,Augusta West Kampground,Winthrop,Annabessacook Lake,4769,Paid,12:00,0.0,18:00,360,1.0,0.00,72.0,45.0,49.0
3,2021-05-28,Fri,East Winthrop,Winthrop,Cobbosseecontee Lake,4485,Paid,12:00,1.0,18:00,360,2.0,0.00,72.0,45.0,49.0
4,2021-05-29,Sat,Thorofare Rd,Litchfield,Pleasant Pond,4944,Paid,7:00,1.0,17:00,600,11.0,0.02,62.0,45.0,46.0

In [84]:
df.to_csv('df_with_weather.csv', index=False)